zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/include/pio/pic32ck1012sg01064.h
/* ================== PORT definition for CAN0 peripheral =================== */
#define PIN_PB01H_CAN0_RX                          _UINT32_(33)
#define MUX_PB01H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PB01H_CAN0_RX                       ((PIN_PB01H_CAN0_RX << 16) | MUX_PB01H_CAN0_RX)
#define PORT_PB01H_CAN0_RX                         (_UINT32_(1) << 1)

#define PIN_PB09H_CAN0_RX                          _UINT32_(41)
#define MUX_PB09H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PB09H_CAN0_RX                       ((PIN_PB09H_CAN0_RX << 16) | MUX_PB09H_CAN0_RX)
#define PORT_PB09H_CAN0_RX                         (_UINT32_(1) << 9)

#define PIN_PC03H_CAN0_RX                          _UINT32_(67)
#define MUX_PC03H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC03H_CAN0_RX                       ((PIN_PC03H_CAN0_RX << 16) | MUX_PC03H_CAN0_RX)
#define PORT_PC03H_CAN0_RX                         (_UINT32_(1) << 3)

#define PIN_PC07H_CAN0_RX                          _UINT32_(71)
#define MUX_PC07H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC07H_CAN0_RX                       ((PIN_PC07H_CAN0_RX << 16) | MUX_PC07H_CAN0_RX)
#define PORT_PC07H_CAN0_RX                         (_UINT32_(1) << 7)

#define PIN_PB00H_CAN0_TX                          _UINT32_(32)
#define MUX_PB00H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PB00H_CAN0_TX                       ((PIN_PB00H_CAN0_TX << 16) | MUX_PB00H_CAN0_TX)
#define PORT_PB00H_CAN0_TX                         (_UINT32_(1) << 0)

#define PIN_PB08H_CAN0_TX                          _UINT32_(40)
#define MUX_PB08H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PB08H_CAN0_TX                       ((PIN_PB08H_CAN0_TX << 16) | MUX_PB08H_CAN0_TX)
#define PORT_PB08H_CAN0_TX                         (_UINT32_(1) << 8)

#define PIN_PC02H_CAN0_TX                          _UINT32_(66)
#define MUX_PC02H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC02H_CAN0_TX                       ((PIN_PC02H_CAN0_TX << 16) | MUX_PC02H_CAN0_TX)
#define PORT_PC02H_CAN0_TX                         (_UINT32_(1) << 2)

#define PIN_PC06H_CAN0_TX                          _UINT32_(70)
#define MUX_PC06H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN0_TX                       ((PIN_PC06H_CAN0_TX << 16) | MUX_PC06H_CAN0_TX)
#define PORT_PC06H_CAN0_TX                         (_UINT32_(1) << 6)

/* =================== PORT definition for CCL peripheral =================== */
#define PIN_PB02M_CCL_IN0                          _UINT32_(34)
#define MUX_PB02M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB02M_CCL_IN0                       ((PIN_PB02M_CCL_IN0 << 16) | MUX_PB02M_CCL_IN0)
#define PORT_PB02M_CCL_IN0                         (_UINT32_(1) << 2)

#define PIN_PB07M_CCL_IN0                          _UINT32_(39)
#define MUX_PB07M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB07M_CCL_IN0                       ((PIN_PB07M_CCL_IN0 << 16) | MUX_PB07M_CCL_IN0)
#define PORT_PB07M_CCL_IN0                         (_UINT32_(1) << 7)

#define PIN_PB03M_CCL_IN1                          _UINT32_(35)
#define MUX_PB03M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB03M_CCL_IN1                       ((PIN_PB03M_CCL_IN1 << 16) | MUX_PB03M_CCL_IN1)
#define PORT_PB03M_CCL_IN1                         (_UINT32_(1) << 3)

#define PIN_PB08M_CCL_IN1                          _UINT32_(40)
#define MUX_PB08M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB08M_CCL_IN1                       ((PIN_PB08M_CCL_IN1 << 16) | MUX_PB08M_CCL_IN1)
#define PORT_PB08M_CCL_IN1                         (_UINT32_(1) << 8)

#define PIN_PB09M_CCL_IN2                          _UINT32_(41)
#define MUX_PB09M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PB09M_CCL_IN2                       ((PIN_PB09M_CCL_IN2 << 16) | MUX_PB09M_CCL_IN2)
#define PORT_PB09M_CCL_IN2                         (_UINT32_(1) << 9)

#define PIN_PD02M_CCL_IN2                          _UINT32_(98)
#define MUX_PD02M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PD02M_CCL_IN2                       ((PIN_PD02M_CCL_IN2 << 16) | MUX_PD02M_CCL_IN2)
#define PORT_PD02M_CCL_IN2                         (_UINT32_(1) << 2)

#define PIN_PC10M_CCL_IN3                          _UINT32_(74)
#define MUX_PC10M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC10M_CCL_IN3                       ((PIN_PC10M_CCL_IN3 << 16) | MUX_PC10M_CCL_IN3)
#define PORT_PC10M_CCL_IN3                         (_UINT32_(1) << 10)

#define PIN_PC11M_CCL_IN4                          _UINT32_(75)
#define MUX_PC11M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC11M_CCL_IN4                       ((PIN_PC11M_CCL_IN4 << 16) | MUX_PC11M_CCL_IN4)
#define PORT_PC11M_CCL_IN4                         (_UINT32_(1) << 11)

#define PIN_PC06M_CCL_IN5                          _UINT32_(70)
#define MUX_PC06M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC06M_CCL_IN5                       ((PIN_PC06M_CCL_IN5 << 16) | MUX_PC06M_CCL_IN5)
#define PORT_PC06M_CCL_IN5                         (_UINT32_(1) << 6)

#define PIN_PC12M_CCL_IN5                          _UINT32_(76)
#define MUX_PC12M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC12M_CCL_IN5                       ((PIN_PC12M_CCL_IN5 << 16) | MUX_PC12M_CCL_IN5)
#define PORT_PC12M_CCL_IN5                         (_UINT32_(1) << 12)

#define PIN_PB00M_CCL_IN6                          _UINT32_(32)
#define MUX_PB00M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PB00M_CCL_IN6                       ((PIN_PB00M_CCL_IN6 << 16) | MUX_PB00M_CCL_IN6)
#define PORT_PB00M_CCL_IN6                         (_UINT32_(1) << 0)

#define PIN_PD08M_CCL_IN6                          _UINT32_(104)
#define MUX_PD08M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PD08M_CCL_IN6                       ((PIN_PD08M_CCL_IN6 << 16) | MUX_PD08M_CCL_IN6)
#define PORT_PD08M_CCL_IN6                         (_UINT32_(1) << 8)

