zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/include/pio/pic32ck1012sg01064.h
#define PIN_PC03L_ETH_MDC                          _UINT32_(67)
#define MUX_PC03L_ETH_MDC                          _UINT32_(11)
#define PINMUX_PC03L_ETH_MDC                       ((PIN_PC03L_ETH_MDC << 16) | MUX_PC03L_ETH_MDC)
#define PORT_PC03L_ETH_MDC                         (_UINT32_(1) << 3)

#define PIN_PD07L_ETH_MDC                          _UINT32_(103)
#define MUX_PD07L_ETH_MDC                          _UINT32_(11)
#define PINMUX_PD07L_ETH_MDC                       ((PIN_PD07L_ETH_MDC << 16) | MUX_PD07L_ETH_MDC)
#define PORT_PD07L_ETH_MDC                         (_UINT32_(1) << 7)

#define PIN_PA12O_ETH_MDIO                         _UINT32_(12)
#define MUX_PA12O_ETH_MDIO                         _UINT32_(14)
#define PINMUX_PA12O_ETH_MDIO                      ((PIN_PA12O_ETH_MDIO << 16) | MUX_PA12O_ETH_MDIO)
#define PORT_PA12O_ETH_MDIO                        (_UINT32_(1) << 12)

#define PIN_PD06O_ETH_MDIO                         _UINT32_(102)
#define MUX_PD06O_ETH_MDIO                         _UINT32_(14)
#define PINMUX_PD06O_ETH_MDIO                      ((PIN_PD06O_ETH_MDIO << 16) | MUX_PD06O_ETH_MDIO)
#define PORT_PD06O_ETH_MDIO                        (_UINT32_(1) << 6)

#define PIN_PA12L_ETH_MDIO                         _UINT32_(12)
#define MUX_PA12L_ETH_MDIO                         _UINT32_(11)
#define PINMUX_PA12L_ETH_MDIO                      ((PIN_PA12L_ETH_MDIO << 16) | MUX_PA12L_ETH_MDIO)
#define PORT_PA12L_ETH_MDIO                        (_UINT32_(1) << 12)

#define PIN_PC02L_ETH_MDIO                         _UINT32_(66)
#define MUX_PC02L_ETH_MDIO                         _UINT32_(11)
#define PINMUX_PC02L_ETH_MDIO                      ((PIN_PC02L_ETH_MDIO << 16) | MUX_PC02L_ETH_MDIO)
#define PORT_PC02L_ETH_MDIO                        (_UINT32_(1) << 2)

#define PIN_PC04L_ETH_MDIO                         _UINT32_(68)
#define MUX_PC04L_ETH_MDIO                         _UINT32_(11)
#define PINMUX_PC04L_ETH_MDIO                      ((PIN_PC04L_ETH_MDIO << 16) | MUX_PC04L_ETH_MDIO)
#define PORT_PC04L_ETH_MDIO                        (_UINT32_(1) << 4)

#define PIN_PD06L_ETH_MDIO                         _UINT32_(102)
#define MUX_PD06L_ETH_MDIO                         _UINT32_(11)
#define PINMUX_PD06L_ETH_MDIO                      ((PIN_PD06L_ETH_MDIO << 16) | MUX_PD06L_ETH_MDIO)
#define PORT_PD06L_ETH_MDIO                        (_UINT32_(1) << 6)

#define PIN_PC00L_ETH_REF_CLK                      _UINT32_(64)
#define MUX_PC00L_ETH_REF_CLK                      _UINT32_(11)
#define PINMUX_PC00L_ETH_REF_CLK                   ((PIN_PC00L_ETH_REF_CLK << 16) | MUX_PC00L_ETH_REF_CLK)
#define PORT_PC00L_ETH_REF_CLK                     (_UINT32_(1) << 0)

#define PIN_PC02O_ETH_RXD0                         _UINT32_(66)
#define MUX_PC02O_ETH_RXD0                         _UINT32_(14)
#define PINMUX_PC02O_ETH_RXD0                      ((PIN_PC02O_ETH_RXD0 << 16) | MUX_PC02O_ETH_RXD0)
#define PORT_PC02O_ETH_RXD0                        (_UINT32_(1) << 2)

#define PIN_PC07L_ETH_RXD0                         _UINT32_(71)
#define MUX_PC07L_ETH_RXD0                         _UINT32_(11)
#define PINMUX_PC07L_ETH_RXD0                      ((PIN_PC07L_ETH_RXD0 << 16) | MUX_PC07L_ETH_RXD0)
#define PORT_PC07L_ETH_RXD0                        (_UINT32_(1) << 7)

#define PIN_PC01O_ETH_RXD1                         _UINT32_(65)
#define MUX_PC01O_ETH_RXD1                         _UINT32_(14)
#define PINMUX_PC01O_ETH_RXD1                      ((PIN_PC01O_ETH_RXD1 << 16) | MUX_PC01O_ETH_RXD1)
#define PORT_PC01O_ETH_RXD1                        (_UINT32_(1) << 1)

#define PIN_PC06L_ETH_RXD1                         _UINT32_(70)
#define MUX_PC06L_ETH_RXD1                         _UINT32_(11)
#define PINMUX_PC06L_ETH_RXD1                      ((PIN_PC06L_ETH_RXD1 << 16) | MUX_PC06L_ETH_RXD1)
#define PORT_PC06L_ETH_RXD1                        (_UINT32_(1) << 6)

#define PIN_PC05L_ETH_RXD2                         _UINT32_(69)
#define MUX_PC05L_ETH_RXD2                         _UINT32_(11)
#define PINMUX_PC05L_ETH_RXD2                      ((PIN_PC05L_ETH_RXD2 << 16) | MUX_PC05L_ETH_RXD2)
#define PORT_PC05L_ETH_RXD2                        (_UINT32_(1) << 5)

#define PIN_PC10O_ETH_RXDV                         _UINT32_(74)
#define MUX_PC10O_ETH_RXDV                         _UINT32_(14)
#define PINMUX_PC10O_ETH_RXDV                      ((PIN_PC10O_ETH_RXDV << 16) | MUX_PC10O_ETH_RXDV)
#define PORT_PC10O_ETH_RXDV                        (_UINT32_(1) << 10)

#define PIN_PC10L_ETH_RXDV                         _UINT32_(74)
#define MUX_PC10L_ETH_RXDV                         _UINT32_(11)
#define PINMUX_PC10L_ETH_RXDV                      ((PIN_PC10L_ETH_RXDV << 16) | MUX_PC10L_ETH_RXDV)
#define PORT_PC10L_ETH_RXDV                        (_UINT32_(1) << 10)

#define PIN_PC03O_ETH_RXER                         _UINT32_(67)
#define MUX_PC03O_ETH_RXER                         _UINT32_(14)
#define PINMUX_PC03O_ETH_RXER                      ((PIN_PC03O_ETH_RXER << 16) | MUX_PC03O_ETH_RXER)
#define PORT_PC03O_ETH_RXER                        (_UINT32_(1) << 3)

#define PIN_PC09L_ETH_RXER                         _UINT32_(73)
#define MUX_PC09L_ETH_RXER                         _UINT32_(11)
#define PINMUX_PC09L_ETH_RXER                      ((PIN_PC09L_ETH_RXER << 16) | MUX_PC09L_ETH_RXER)
#define PORT_PC09L_ETH_RXER                        (_UINT32_(1) << 9)

#define PIN_PD02O_ETH_TSUCOMP                      _UINT32_(98)
#define MUX_PD02O_ETH_TSUCOMP                      _UINT32_(14)
#define PINMUX_PD02O_ETH_TSUCOMP                   ((PIN_PD02O_ETH_TSUCOMP << 16) | MUX_PD02O_ETH_TSUCOMP)
#define PORT_PD02O_ETH_TSUCOMP                     (_UINT32_(1) << 2)

#define PIN_PD02L_ETH_TSUCOMP                      _UINT32_(98)
#define MUX_PD02L_ETH_TSUCOMP                      _UINT32_(11)
#define PINMUX_PD02L_ETH_TSUCOMP                   ((PIN_PD02L_ETH_TSUCOMP << 16) | MUX_PD02L_ETH_TSUCOMP)
#define PORT_PD02L_ETH_TSUCOMP                     (_UINT32_(1) << 2)

#define PIN_PC06O_ETH_TXD0                         _UINT32_(70)
#define MUX_PC06O_ETH_TXD0                         _UINT32_(14)
#define PINMUX_PC06O_ETH_TXD0                      ((PIN_PC06O_ETH_TXD0 << 16) | MUX_PC06O_ETH_TXD0)
#define PORT_PC06O_ETH_TXD0                        (_UINT32_(1) << 6)

#define PIN_PC12L_ETH_TXD0                         _UINT32_(76)
#define MUX_PC12L_ETH_TXD0                         _UINT32_(11)
#define PINMUX_PC12L_ETH_TXD0                      ((PIN_PC12L_ETH_TXD0 << 16) | MUX_PC12L_ETH_TXD0)
#define PORT_PC12L_ETH_TXD0                        (_UINT32_(1) << 12)

