zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/include/pio/pic32ck1012sg01064.h
#define PIN_PB07I_SDMMC0_SDCMD                     _UINT32_(39)
#define MUX_PB07I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PB07I_SDMMC0_SDCMD                  ((PIN_PB07I_SDMMC0_SDCMD << 16) | MUX_PB07I_SDMMC0_SDCMD)
#define PORT_PB07I_SDMMC0_SDCMD                    (_UINT32_(1) << 7)

#define PIN_PC06I_SDMMC0_SDCMD                     _UINT32_(70)
#define MUX_PC06I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PC06I_SDMMC0_SDCMD                  ((PIN_PC06I_SDMMC0_SDCMD << 16) | MUX_PC06I_SDMMC0_SDCMD)
#define PORT_PC06I_SDMMC0_SDCMD                    (_UINT32_(1) << 6)

#define PIN_PD06I_SDMMC0_SDCMD                     _UINT32_(102)
#define MUX_PD06I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PD06I_SDMMC0_SDCMD                  ((PIN_PD06I_SDMMC0_SDCMD << 16) | MUX_PD06I_SDMMC0_SDCMD)
#define PORT_PD06I_SDMMC0_SDCMD                    (_UINT32_(1) << 6)

#define PIN_PB10I_SDMMC0_SDDAT0                    _UINT32_(42)
#define MUX_PB10I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PB10I_SDMMC0_SDDAT0                 ((PIN_PB10I_SDMMC0_SDDAT0 << 16) | MUX_PB10I_SDMMC0_SDDAT0)
#define PORT_PB10I_SDMMC0_SDDAT0                   (_UINT32_(1) << 10)

#define PIN_PC07I_SDMMC0_SDDAT0                    _UINT32_(71)
#define MUX_PC07I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PC07I_SDMMC0_SDDAT0                 ((PIN_PC07I_SDMMC0_SDDAT0 << 16) | MUX_PC07I_SDMMC0_SDDAT0)
#define PORT_PC07I_SDMMC0_SDDAT0                   (_UINT32_(1) << 7)

#define PIN_PD07I_SDMMC0_SDDAT0                    _UINT32_(103)
#define MUX_PD07I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PD07I_SDMMC0_SDDAT0                 ((PIN_PD07I_SDMMC0_SDDAT0 << 16) | MUX_PD07I_SDMMC0_SDDAT0)
#define PORT_PD07I_SDMMC0_SDDAT0                   (_UINT32_(1) << 7)

#define PIN_PC00I_SDMMC0_SDDAT1                    _UINT32_(64)
#define MUX_PC00I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PC00I_SDMMC0_SDDAT1                 ((PIN_PC00I_SDMMC0_SDDAT1 << 16) | MUX_PC00I_SDMMC0_SDDAT1)
#define PORT_PC00I_SDMMC0_SDDAT1                   (_UINT32_(1) << 0)

#define PIN_PD11I_SDMMC0_SDDAT1                    _UINT32_(107)
#define MUX_PD11I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PD11I_SDMMC0_SDDAT1                 ((PIN_PD11I_SDMMC0_SDDAT1 << 16) | MUX_PD11I_SDMMC0_SDDAT1)
#define PORT_PD11I_SDMMC0_SDDAT1                   (_UINT32_(1) << 11)

#define PIN_PC01I_SDMMC0_SDDAT2                    _UINT32_(65)
#define MUX_PC01I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PC01I_SDMMC0_SDDAT2                 ((PIN_PC01I_SDMMC0_SDDAT2 << 16) | MUX_PC01I_SDMMC0_SDDAT2)
#define PORT_PC01I_SDMMC0_SDDAT2                   (_UINT32_(1) << 1)

#define PIN_PD08I_SDMMC0_SDDAT2                    _UINT32_(104)
#define MUX_PD08I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PD08I_SDMMC0_SDDAT2                 ((PIN_PD08I_SDMMC0_SDDAT2 << 16) | MUX_PD08I_SDMMC0_SDDAT2)
#define PORT_PD08I_SDMMC0_SDDAT2                   (_UINT32_(1) << 8)

#define PIN_PC02I_SDMMC0_SDDAT3                    _UINT32_(66)
#define MUX_PC02I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PC02I_SDMMC0_SDDAT3                 ((PIN_PC02I_SDMMC0_SDDAT3 << 16) | MUX_PC02I_SDMMC0_SDDAT3)
#define PORT_PC02I_SDMMC0_SDDAT3                   (_UINT32_(1) << 2)

#define PIN_PD09I_SDMMC0_SDDAT3                    _UINT32_(105)
#define MUX_PD09I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PD09I_SDMMC0_SDDAT3                 ((PIN_PD09I_SDMMC0_SDDAT3 << 16) | MUX_PD09I_SDMMC0_SDDAT3)
#define PORT_PD09I_SDMMC0_SDDAT3                   (_UINT32_(1) << 9)

#define PIN_PB00I_SDMMC0_SDWP                      _UINT32_(32)
#define MUX_PB00I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PB00I_SDMMC0_SDWP                   ((PIN_PB00I_SDMMC0_SDWP << 16) | MUX_PB00I_SDMMC0_SDWP)
#define PORT_PB00I_SDMMC0_SDWP                     (_UINT32_(1) << 0)

#define PIN_PC03I_SDMMC0_SDWP                      _UINT32_(67)
#define MUX_PC03I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PC03I_SDMMC0_SDWP                   ((PIN_PC03I_SDMMC0_SDWP << 16) | MUX_PC03I_SDMMC0_SDWP)
#define PORT_PC03I_SDMMC0_SDWP                     (_UINT32_(1) << 3)

#define PIN_PD05I_SDMMC0_SDWP                      _UINT32_(101)
#define MUX_PD05I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PD05I_SDMMC0_SDWP                   ((PIN_PD05I_SDMMC0_SDWP << 16) | MUX_PD05I_SDMMC0_SDWP)
#define PORT_PD05I_SDMMC0_SDWP                     (_UINT32_(1) << 5)

/* ================= PORT definition for SERCOM0 peripheral ================= */
#define PIN_PC10C_SERCOM0_PAD0                     _UINT32_(74)
#define MUX_PC10C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PC10C_SERCOM0_PAD0                  ((PIN_PC10C_SERCOM0_PAD0 << 16) | MUX_PC10C_SERCOM0_PAD0)
#define PORT_PC10C_SERCOM0_PAD0                    (_UINT32_(1) << 10)

#define PIN_PD06C_SERCOM0_PAD0                     _UINT32_(102)
#define MUX_PD06C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PD06C_SERCOM0_PAD0                  ((PIN_PD06C_SERCOM0_PAD0 << 16) | MUX_PD06C_SERCOM0_PAD0)
#define PORT_PD06C_SERCOM0_PAD0                    (_UINT32_(1) << 6)

#define PIN_PC11C_SERCOM0_PAD1                     _UINT32_(75)
#define MUX_PC11C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PC11C_SERCOM0_PAD1                  ((PIN_PC11C_SERCOM0_PAD1 << 16) | MUX_PC11C_SERCOM0_PAD1)
#define PORT_PC11C_SERCOM0_PAD1                    (_UINT32_(1) << 11)

#define PIN_PD07C_SERCOM0_PAD1                     _UINT32_(103)
#define MUX_PD07C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PD07C_SERCOM0_PAD1                  ((PIN_PD07C_SERCOM0_PAD1 << 16) | MUX_PD07C_SERCOM0_PAD1)
#define PORT_PD07C_SERCOM0_PAD1                    (_UINT32_(1) << 7)

#define PIN_PA00C_SERCOM0_PAD2                     _UINT32_(0) 
#define MUX_PA00C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PA00C_SERCOM0_PAD2                  ((PIN_PA00C_SERCOM0_PAD2 << 16) | MUX_PA00C_SERCOM0_PAD2)
#define PORT_PA00C_SERCOM0_PAD2                    (_UINT32_(1) << 0)

#define PIN_PC12C_SERCOM0_PAD2                     _UINT32_(76)
#define MUX_PC12C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PC12C_SERCOM0_PAD2                  ((PIN_PC12C_SERCOM0_PAD2 << 16) | MUX_PC12C_SERCOM0_PAD2)
#define PORT_PC12C_SERCOM0_PAD2                    (_UINT32_(1) << 12)

#define PIN_PD05C_SERCOM0_PAD2                     _UINT32_(101)
#define MUX_PD05C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PD05C_SERCOM0_PAD2                  ((PIN_PD05C_SERCOM0_PAD2 << 16) | MUX_PD05C_SERCOM0_PAD2)
#define PORT_PD05C_SERCOM0_PAD2                    (_UINT32_(1) << 5)

